<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;

class InitialDataSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('users')->insert([
           ['name' => 'admin', 'email' => 'admin@gmail.com', 'password' => Hash::make('pepega'), 'is_admin' => true],
        ]);
        DB::table('categories')->insert([
            ['name' => 'Супы', 'photo_path' => 'category/soups.jpg'],
            ['name' => 'Горячее', 'photo_path' => 'category/hotter.jpg'],
            ['name' => 'Салаты', 'photo_path' => 'category/salads.jpg'],
            ['name' => 'Закуски', 'photo_path' => 'category/snacks.jpg'],
            ['name' => 'Соусы', 'photo_path' => 'category/sauces.jpg'],
            ['name' => 'Изделия из теста', 'photo_path' => 'category/dough.jpg'],
            ['name' => 'Десерты', 'photo_path' => 'category/desserts.jpg'],
            ['name' => 'Мангал', 'photo_path' => 'category/grill.jpg'],
        ]);
        // Вставка данных в таблицу dishes
//        DB::table('dishes')->insert([
//            [
//                'category_id' => 1,
//                'name' => 'Борщ',
//                'cooking_method' => 'Приготовление бульона: В большую кастрюлю налейте около 2,5 литров воды, добавьте говядину на кости и доведите до кипения. Снимите пену, уменьшите огонь и варите бульон на слабом огне около 1 часа.
//                    Подготовка овощей: Пока варится бульон, нарежьте картофель кубиками, капусту — тонкими полосками, свеклу — соломкой или натрите на крупной тёрке. Морковь натрите на крупной тёрке, лук мелко нарежьте. Помидоры нарежьте кубиками.
//                    Обжарка свеклы: На сковороде разогрейте растительное масло, добавьте свеклу, немного уксуса (чтобы сохранить цвет), и тушите на среднем огне 10 минут, добавив немного бульона.
//                    Обжарка овощей: На другой сковороде обжарьте лук до прозрачности, затем добавьте морковь и помидоры или томатную пасту. Обжаривайте все вместе до мягкости.
//                    Добавление овощей в бульон: В бульон добавьте картофель и варите 10 минут, затем добавьте капусту и продолжайте варить ещё 5 минут.
//                    Сборка борща: Добавьте в кастрюлю обжаренную свеклу и луково-морковную зажарку. Перемешайте, добавьте лавровый лист, соль и перец по вкусу. Варите на слабом огне ещё 10–15 минут.
//                    Финальные штрихи: В конце добавьте мелко нарезанный чеснок и зелень. Дайте борщу настояться под крышкой 10–15 минут перед подачей.',
//                'cooking_time' => 90,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Плов',
//                'cooking_method' => 'Подготовка мяса и овощей: Нарежьте мясо крупными кубиками. Морковь нарежьте длинной соломкой, лук — полукольцами.
//                    Обжарка мяса: В большом казане разогрейте растительное масло, добавьте мясо и обжарьте на сильном огне до золотистой корочки.
//                    Добавление лука и моркови: Добавьте в казан лук и обжарьте до мягкости, затем добавьте морковь и продолжайте обжаривать ещё несколько минут.
//                    Приготовление зирвака: Добавьте в казан специи (зиру, соль, перец) и залейте водой так, чтобы она полностью покрывала мясо и овощи. Тушите на среднем огне 20–30 минут.
//                    Добавление риса: Тщательно промойте рис и аккуратно распределите его поверх зирвака. Не перемешивайте! Вставьте головку чеснока в центр.
//                    Приготовление плова: Добавьте воды так, чтобы она покрывала рис примерно на 1–1.5 см. Увеличьте огонь и доведите до кипения, затем уменьшите огонь до минимума и варите под крышкой, пока вода полностью не впитается в рис (около 15–20 минут).
//                    Финальные штрихи: Снимите казан с огня, укутайте его полотенцем и дайте настояться 10–15 минут.',
//                'cooking_time' => 60,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Цезарь',
//                'cooking_method' => 'Приготовление гренок: Нарежьте хлеб кубиками, обжарьте на сковороде с небольшим количеством оливкового масла и зубчиком чеснока до золотистой корочки.
//                    Приготовление курицы: Куриное филе нарежьте полосками, посолите, поперчите и обжарьте на сковороде с оливковым маслом до готовности.
//                    Подготовка листьев салата: Вымойте и высушите листья салата, порвите их руками на крупные куски и выложите в большую миску.
//                    Приготовление соуса: Смешайте все ингредиенты для соуса: майонез, измельченный чеснок, лимонный сок, горчицу, оливковое масло, соль и перец.
//                    Сборка салата: В салатник с листьями добавьте обжаренные кусочки курицы, гренки, полейте всё приготовленным соусом и перемешайте.',
//                'cooking_time' => 30,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Оливье',
//                'cooking_method' => 'Отварите овощи и яйца: Положите картофель и морковь в кастрюлю с холодной водой, доведите до кипения и варите до мягкости (около 20 минут для картофеля и 15 минут для моркови). Остудите и очистите. Яйца варите в кипящей воде 10 минут, затем остудите под холодной водой и очистите.
//                    Нарежьте ингредиенты: Нарежьте картофель, морковь, яйца, колбасу или курицу, и солёные огурцы мелкими кубиками. Лук нарежьте мелко (по желанию).
//                    Смешайте ингредиенты: В большой миске смешайте нарезанные овощи, колбасу, яйца и консервированный горошек (предварительно слейте жидкость).
//                    Заправьте салат: Добавьте майонез, посолите и поперчите по вкусу. Тщательно перемешайте.',
//                'cooking_time' => 30,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Греческий',
//                'cooking_method' => 'Подготовьте овощи: Помидоры нарежьте крупными кусочками, огурцы — полукружиями, лук — тонкими кольцами, а сладкий перец — полосками.
//                    Смешайте ингредиенты: Выложите все нарезанные овощи в большую миску, добавьте маслины.
//                    Добавьте сыр фета: Сыр фета нарежьте кубиками или покрошите руками и добавьте в салат.
//                    Заправьте салат: Полейте оливковым маслом, посыпьте орегано, солью и перцем по вкусу.',
//                'cooking_time' => 10,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Куриные котлеты',
//                'cooking_method' => 'Подготовьте ингредиенты: Мелко нарежьте или измельчите в блендере лук и чеснок. Размочите ломтик хлеба в небольшом количестве молока и хорошо отожмите.
//                    Смешайте фарш: В миске соедините куриный фарш, лук, чеснок, яйцо, размоченный хлеб, соль и перец. Тщательно перемешайте фарш до однородности.
//                    Сформируйте котлеты: Сформируйте из фарша котлеты среднего размера. По желанию обваляйте их в панировочных сухарях.
//                    Обжарьте котлеты: В сковороде разогрейте растительное масло на среднем огне. Обжаривайте котлеты с двух сторон до золотистой корочки (примерно по 4-5 минут с каждой стороны).
//                    Доведите до готовности: Чтобы котлеты точно были готовы внутри, можно накрыть сковороду крышкой и уменьшить огонь, готовя их ещё 5 минут.',
//                'cooking_time' => 25,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 1,
//                'name' => 'Рассольник',
//                'cooking_method' => 'Приготовьте бульон: В кастрюле доведите воду до кипения, добавьте мясо на кости и варите около 1 часа. Нарежьте картофель кубиками, морковь — соломкой, лук — мелко. Огурцы натрите на терке.
//                                 Обжарьте лук с морковью на растительном масле. Добавьте в бульон картофель и огурцы, варите 10 минут, затем добавьте обжарку. Варите до готовности овощей.',
//                'cooking_time' => 70,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Жареная рыба с картофелем',
//                'cooking_method' => 'Очистите и нарежьте картофель, отварите его в подсоленной воде. Рыбу нарежьте порционными кусками, посолите, поперчите и обжарьте на растительном масле с двух сторон до готовности.
//                                 Подавайте рыбу с картофелем, посыпав зеленью.',
//                'cooking_time' => 40,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Винегрет',
//                'cooking_method' => 'Отварите свеклу, картофель и морковь до готовности. Нарежьте свеклу, картофель, морковь и солёные огурцы кубиками. Добавьте консервированный горошек, лук и заправьте растительным маслом.',
//                'cooking_time' => 45,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 1,
//                'name' => 'Солянка',
//                'cooking_method' => 'Приготовьте мясной бульон. Нарежьте колбасу, соленые огурцы и обжарьте их вместе с томатной пастой. Добавьте все ингредиенты в бульон, варите 10 минут.
//                                 Перед подачей добавьте маслины, лимон и сметану.',
//                'cooking_time' => 60,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Тефтели в томатном соусе',
//                'cooking_method' => 'Смешайте фарш с луком и чесноком, добавьте яйцо и панировочные сухари, сформируйте тефтели. Обжарьте их на растительном масле. Томатную пасту смешайте с водой, добавьте соль, перец и тушите тефтели в соусе 20 минут.',
//                'cooking_time' => 45,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Сельдь под шубой',
//                'cooking_method' => 'Отварите свеклу, картофель и морковь. Нарежьте сельдь, лук. Слоями выложите картофель, сельдь, лук, морковь и свеклу, каждый слой смазывая майонезом.',
//                'cooking_time' => 50,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Макароны по-флотски',
//                'cooking_method' => 'Отварите макароны в подсоленной воде. Обжарьте лук на растительном масле, добавьте фарш и обжаривайте до готовности. Смешайте макароны с фаршем, подавайте горячими.',
//                'cooking_time' => 30,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 2,
//                'name' => 'Лазанья',
//                'cooking_method' => 'Подготовка соуса болоньезе: На сковороде обжарьте лук и чеснок, затем добавьте фарш и обжаривайте до готовности. Добавьте томатную пасту и тушите 20 минут. Подготовка соуса бешамель: Растопите сливочное масло, добавьте муку и обжарьте, постепенно влейте молоко, помешивая, до загустения. Сборка лазаньи: На дно формы для запекания выложите слой соуса болоньезе, затем листы лазаньи, слой бешамеля и повторяйте слои. Посыпьте тёртым сыром и запекайте при температуре 180°C около 40 минут.',
//                'cooking_time' => 90,
//                'user_id' => 1,
//            ],
//            [
//                'category_id' => 3,
//                'name' => 'Салат Нисуаз',
//                'cooking_method' => 'Отварите картофель и яйца. Нарежьте картофель ломтиками, яйца разрежьте на четвертинки. Выложите на тарелку зелёный салат, добавьте нарезанные овощи: огурцы, помидоры, красный лук. Добавьте тунец и варёные яйца. Заправьте салат оливковым маслом, лимонным соком, солью и перцем. По желанию добавьте маслины.',
//                'cooking_time' => 30,
//                'user_id' => 1,
//            ]
//        ]);
        DB::table('ingredients')->insert([
            ['name' => 'Гречка', 'units' => 'г'],
            ['name' => 'Рис', 'units' => 'г'],
            ['name' => 'Овсяные хлопья', 'units' => 'г'],
            ['name' => 'Пшено', 'units' => 'г'],
            ['name' => 'Перловка', 'units' => 'г'],
            ['name' => 'Ячмень', 'units' => 'г'],
            ['name' => 'Булгур', 'units' => 'г'],
            ['name' => 'Кускус', 'units' => 'г'],
            ['name' => 'Манка', 'units' => 'г'],
            ['name' => 'Киноа', 'units' => 'г'],
            ['name' => 'Говядина', 'units' => 'г'],
            ['name' => 'Свинина', 'units' => 'г'],
            ['name' => 'Курица', 'units' => 'г'],
            ['name' => 'Индейка', 'units' => 'г'],
            ['name' => 'Баранина', 'units' => 'г'],
            ['name' => 'Утка', 'units' => 'г'],
            ['name' => 'Кролик', 'units' => 'г'],
            ['name' => 'Телятина', 'units' => 'г'],
            ['name' => 'Гусь', 'units' => 'г'],
            ['name' => 'Яйцо куриное', 'units' => 'шт'],
            ['name' => 'Яйцо перепелиное', 'units' => 'шт'],
            ['name' => 'Щука', 'units' => 'г'],
            ['name' => 'Окунь', 'units' => 'г'],
            ['name' => 'Карась', 'units' => 'г'],
            ['name' => 'Судак', 'units' => 'г'],
            ['name' => 'Карп', 'units' => 'г'],
            ['name' => 'Лещ', 'units' => 'г'],
            ['name' => 'Ёрш', 'units' => 'г'],
            ['name' => 'Голавль', 'units' => 'г'],
            ['name' => 'Речная треска', 'units' => 'г'],
            ['name' => 'Треска', 'units' => 'г'],
            ['name' => 'Плотва', 'units' => 'г'],
            ['name' => 'Налим', 'units' => 'г'],
            ['name' => 'Стерлядь', 'units' => 'г'],
            ['name' => 'Вобла', 'units' => 'г'],
            ['name' => 'Тунец', 'units' => 'г'],
            ['name' => 'Лосось', 'units' => 'г'],
            ['name' => 'Дорадо', 'units' => 'г'],
            ['name' => 'Палтус', 'units' => 'г'],
            ['name' => 'Скумбрия', 'units' => 'г'],
            ['name' => 'Камбала', 'units' => 'г'],
            ['name' => 'Морской окунь', 'units' => 'г'],
            ['name' => 'Горбуша', 'units' => 'г'],
            ['name' => 'Сельдь', 'units' => 'г'],
            ['name' => 'Форель', 'units'  => 'г'],
            ['name' => 'Минтай', 'units' => 'г'],
            ['name' => 'Макароны', 'units' => 'г'],
            ['name' => 'Кукурузная крупа', 'units' => 'г'],
            ['name' => 'Чечевица', 'units' => 'г'],
            ['name' => 'Горох', 'units' => 'г'],
            ['name' => 'Соя', 'units' => 'г'],
            ['name' => 'Пшеничная мука', 'units' => 'г'],
            ['name' => 'Ржаная мука', 'units' => 'г'],
            ['name' => 'Соль', 'units' => 'г'],
            ['name' => 'Сахар', 'units' => 'г'],
            ['name' => 'Корица', 'units' => 'г'],
            ['name' => 'Черный перец молотый', 'units' => 'г'],
            ['name' => 'Черный перец горошек', 'units' => 'г'],
            ['name' => 'Кумин', 'units' => 'г'],
            ['name' => 'Тмин', 'units' => 'г'],
            ['name' => 'Сушеные грибы', 'units' => 'г'],
            ['name' => 'Паприка', 'units' => 'г'],
            ['name' => 'Лавровый лист', 'units' => 'г'],
            ['name' => 'Гвоздика', 'units' => 'г'],
            ['name' => 'Мука кукурузная', 'units' => 'г'],
            ['name' => 'Мука картофельная', 'units' => 'г'],
            ['name' => 'Дрожжи', 'units' => 'г'],
            ['name' => 'Ванильный сахар', 'units' => 'г'],
            ['name' => 'Сахарная пудра', 'units' => 'г'],
            ['name' => 'Агар-агар', 'units' => 'г'],
            ['name' => 'Красный перец молотый', 'units' => 'г'],
            ['name' => 'Картофельный крахмал', 'units' => 'г'],
            ['name' => 'Кукурузный крахмал', 'units' => 'г'],
            ['name' => 'Манная крупа', 'units' => 'г'],
            ['name' => 'Семена подсолнечника', 'units' => 'г'],
            ['name' => 'Семена льна', 'units' => 'г'],
            ['name' => 'Кокосовая стружка', 'units' => 'г'],
            ['name' => 'Миндаль', 'units' => 'г'],
            ['name' => 'Фисташки', 'units' => 'г'],
            ['name' => 'Грецкие орехи', 'units' => 'г'],
            ['name' => 'Кешью', 'units' => 'г'],
            ['name' => 'Изюм', 'units' => 'г'],
            ['name' => 'Чернослив', 'units' => 'г'],
            ['name' => 'Финики', 'units' => 'г'],
            ['name' => 'Курага', 'units' => 'г'],
            ['name' => 'Пекан', 'units' => 'г'],
            ['name' => 'Арахис', 'units' => 'г'],
            ['name' => 'Тахини', 'units' => 'г'],
            ['name' => 'Мед', 'units' => 'г'],
            ['name' => 'Сироп агавы', 'units' => 'г'],
            ['name' => 'Кленовый сироп', 'units' => 'г'],
            ['name' => 'Кокосовое молоко', 'units' => 'мл'],
            ['name' => 'Кокосовое масло', 'units' => 'г'],
            ['name' => 'Оливковое масло', 'units' => 'мл'],
            ['name' => 'Подсолнечное масло', 'units' => 'мл'],
            ['name' => 'Горчичное масло', 'units' => 'мл'],
            ['name' => 'Соевый соус', 'units' => 'мл'],
            ['name' => 'Вустерширский соус', 'units' => 'мл'],
            ['name' => 'Томатная паста', 'units' => 'г'],
            ['name' => 'Майонез', 'units' => 'г'],
            ['name' => 'Кетчуп', 'units' => 'г'],
            ['name' => 'Картофель', 'units' => 'г'],
            ['name' => 'Морковь', 'units' => 'г'],
            ['name' => 'Лук репчатый', 'units' => 'г'],
            ['name' => 'Чеснок', 'units' => 'г'],
            ['name' => 'Томаты', 'units' => 'г'],
            ['name' => 'Огурцы', 'units' => 'г'],
            ['name' => 'Капуста белокочанная', 'units' => 'г'],
            ['name' => 'Капуста цветная', 'units' => 'г'],
            ['name' => 'Кабачки', 'units' => 'г'],
            ['name' => 'Баклажаны', 'units' => 'г'],
            ['name' => 'Перец болгарский', 'units' => 'г'],
            ['name' => 'Петрушка', 'units' => 'г'],
            ['name' => 'Укроп', 'units' => 'г'],
            ['name' => 'Шпинат', 'units' => 'г'],
            ['name' => 'Руккола', 'units' => 'г'],
            ['name' => 'Сельдерей', 'units' => 'г'],
            ['name' => 'Тыква', 'units' => 'г'],
            ['name' => 'Брокколи', 'units' => 'г'],
            ['name' => 'Листовой салат', 'units' => 'г'],
            ['name' => 'Фенхель', 'units' => 'г'],
            ['name' => 'Редька', 'units' => 'г'],
            ['name' => 'Свекла', 'units' => 'г'],
            ['name' => 'Артишок', 'units' => 'г'],
            ['name' => 'Спаржа', 'units' => 'г'],
            ['name' => 'Брюссельская капуста', 'units' => 'г'],
            ['name' => 'Томат черри', 'units' => 'г'],
            ['name' => 'Фасоль красная', 'units' => 'г'],
            ['name' => 'Фасоль стручковая', 'units' => 'г'],
            ['name' => 'Чили перец', 'units' => 'г'],
            ['name' => 'Кукуруза', 'units' => 'г'],
            ['name' => 'Батат', 'units' => 'г'],
            ['name' => 'Кукуруза консервировання', 'units' => 'г'],
            ['name' => 'Яблоки', 'units' => 'г'],
            ['name' => 'Груши', 'units' => 'г'],
            ['name' => 'Бананы', 'units' => 'г'],
            ['name' => 'Апельсины', 'units' => 'г'],
            ['name' => 'Мандарины', 'units' => 'г'],
            ['name' => 'Лимоны', 'units' => 'г'],
            ['name' => 'Киви', 'units' => 'г'],
            ['name' => 'Вишня', 'units' => 'г'],
            ['name' => 'Черешня', 'units' => 'г'],
            ['name' => 'Персики', 'units' => 'г'],
            ['name' => 'Нектарин', 'units' => 'г'],
            ['name' => 'Абрикосы', 'units' => 'г'],
            ['name' => 'Сливы', 'units' => 'г'],
            ['name' => 'Гранат', 'units' => 'г'],
            ['name' => 'Манго', 'units' => 'г'],
            ['name' => 'Папайя', 'units' => 'г'],
            ['name' => 'Авокадо', 'units' => 'г'],
            ['name' => 'Инжир', 'units' => 'г'],
            ['name' => 'Арбуз', 'units' => 'г'],
            ['name' => 'Дыня', 'units' => 'г'],
            ['name' => 'Клубника', 'units' => 'г'],
            ['name' => 'Малина', 'units' => 'г'],
            ['name' => 'Черника', 'units' => 'г'],
            ['name' => 'Ежевика', 'units' => 'г'],
            ['name' => 'Крыжовник', 'units' => 'г'],
            ['name' => 'Черный виноград', 'units' => 'г'],
            ['name' => 'Белый виноград', 'units' => 'г'],
            ['name' => 'Маракуйя', 'units' => 'г'],

//            ['name' => 'Говядина на кости', 'units' => 'г'],
//            ['name' => 'Капуста', 'units' => 'г'],
//            ['name' => 'Свекла', 'units' => 'шт.'],
//            ['name' => 'Томатная паста', 'units' => 'ст.л.'],
//            ['name' => 'Лавровый лист', 'units' => 'шт.'],
//            ['name' => 'Соль', 'units' => 'ч.л.'],
//            ['name' => 'Перец', 'units' => 'ч.л.'],
//            ['name' => 'Уксус', 'units' => 'ст.л.'],
//            ['name' => 'Мясо (баранина или говядина)', 'units' => 'г'],
//            ['name' => 'Рис', 'units' => 'г'],
//            ['name' => 'Зира', 'units' => 'ч.л.'],
//            ['name' => 'Чеснок', 'units' => 'зубчик'],
//            ['name' => 'Вода', 'units' => 'мл'],
//            ['name' => 'Морковь', 'units' => 'шт.'],
//            ['name' => 'Лук', 'units' => 'шт.'],
//            ['name' => 'Растительное масло', 'units' => 'мл'],
//            ['name' => 'Белый хлеб', 'units' => 'ломтик'],
//            ['name' => 'Оливковое масло', 'units' => 'мл'],
//            ['name' => 'Куриное филе', 'units' => 'г'],
//            ['name' => 'Листья салата', 'units' => 'г'],
//            ['name' => 'Майонез', 'units' => 'ст.л.'],
//            ['name' => 'Лимонный сок', 'units' => 'ст.л.'],
//            ['name' => 'Горчица', 'units' => 'ч.л.'],
//            ['name' => 'Картофель', 'units' => 'шт.'],
//            ['name' => 'Яйца', 'units' => 'шт.'],
//            ['name' => 'Варёная колбаса', 'units' => 'г'],
//            ['name' => 'Консервированный горошек', 'units' => 'г'],
//            ['name' => 'Солёные огурцы', 'units' => 'шт.'],
//            ['name' => 'Помидоры', 'units' => 'шт.'],
//            ['name' => 'Огурцы', 'units' => 'шт.'],
//            ['name' => 'Красный лук', 'units' => 'шт.'],
//            ['name' => 'Сладкий перец', 'units' => 'шт.'],
//            ['name' => 'Маслины без косточек', 'units' => 'шт.'],
//            ['name' => 'Сыр фета', 'units' => 'г'],
//            ['name' => 'Орегано', 'units' => 'ч.л.'],
//            ['name' => 'Куриный фарш', 'units' => 'г'],
//            ['name' => 'Молоко', 'units' => 'мл'],
//            ['name' => 'Панировочные сухари', 'units' => 'г'],
//            ['name' => 'Сельдь', 'units' => 'г'],
//            ['name' => 'Листы лазаньи', 'units' => 'г'],
//            ['name' => 'Фарш', 'units' => 'г'],
//            ['name' => 'Мука', 'units' => 'ст.л'],
//            ['name' => 'Сыр', 'units' => 'г'],
//            ['name' => 'Тунец консервированный', 'units' => 'г']

        ]);
//        DB::table('recipes')->insert([
//            // Для блюда 'Борщ'
//            ['dish_id' => 1, 'ingredient_id' => 1, 'quantity' => 500], // Говядина на кости, 500 г
//            ['dish_id' => 1, 'ingredient_id' => 2, 'quantity' => 300], // Капуста, 300 г
//            ['dish_id' => 1, 'ingredient_id' => 3, 'quantity' => 1],   // Свекла, 1 шт.
//            ['dish_id' => 1, 'ingredient_id' => 4, 'quantity' => 2],   // Томатная паста, 2 ст.л.
//            ['dish_id' => 1, 'ingredient_id' => 5, 'quantity' => 2],   // Лавровый лист, 2 шт.
//            ['dish_id' => 1, 'ingredient_id' => 6, 'quantity' => 1],   // Соль, по вкусу
//            ['dish_id' => 1, 'ingredient_id' => 7, 'quantity' => 1],   // Перец, по вкусу
//            ['dish_id' => 1, 'ingredient_id' => 8, 'quantity' => 1],   // Уксус, 1 ст.л.
//
//            // Для блюда 'Плов'
//            ['dish_id' => 2, 'ingredient_id' => 9, 'quantity' => 600],  // Мясо (баранина или говядина), 600 г
//            ['dish_id' => 2, 'ingredient_id' => 14, 'quantity' => 2],   // Морковь, 2 шт.
//            ['dish_id' => 2, 'ingredient_id' => 15, 'quantity' => 2],   // Лук, 2 шт.
//            ['dish_id' => 2, 'ingredient_id' => 10, 'quantity' => 300], // Рис, 300 г
//            ['dish_id' => 2, 'ingredient_id' => 11, 'quantity' => 1],   // Зира, 1 ч.л.
//            ['dish_id' => 2, 'ingredient_id' => 6, 'quantity' => 1],    // Соль, по вкусу
//            ['dish_id' => 2, 'ingredient_id' => 7, 'quantity' => 1],    // Перец, по вкусу
//            ['dish_id' => 2, 'ingredient_id' => 12, 'quantity' => 1],   // Чеснок, 1 головка
//            ['dish_id' => 2, 'ingredient_id' => 13, 'quantity' => 500], // Вода, 500 мл
//            ['dish_id' => 2, 'ingredient_id' => 16, 'quantity' => 50],  // Растительное масло, 50 мл
//
//            // Для блюда 'Цезарь'
//            ['dish_id' => 3, 'ingredient_id' => 17, 'quantity' => 2],   // Белый хлеб, 2 ломтика
//            ['dish_id' => 3, 'ingredient_id' => 18, 'quantity' => 50],  // Оливковое масло, 30 мл
//            ['dish_id' => 3, 'ingredient_id' => 12, 'quantity' => 2],   // Чеснок, 1 зубчик
//            ['dish_id' => 3, 'ingredient_id' => 19, 'quantity' => 200], // Куриное филе, 200 г
//            ['dish_id' => 3, 'ingredient_id' => 6, 'quantity' => 1],    // Соль, по вкусу
//            ['dish_id' => 3, 'ingredient_id' => 7, 'quantity' => 1],    // Перец, по вкусу
//            ['dish_id' => 3, 'ingredient_id' => 20, 'quantity' => 100], // Листья салата, 100 г
//            ['dish_id' => 3, 'ingredient_id' => 21, 'quantity' => 3],   // Майонез, 3 ст.л.
//            ['dish_id' => 3, 'ingredient_id' => 22, 'quantity' => 1],   // Лимонный сок, 1 ст.л.
//            ['dish_id' => 3, 'ingredient_id' => 23, 'quantity' => 1],   // Горчица, 1 ч.л.
//
//
//
//            // Для блюда 'Оливье'
//            ['dish_id' => 4, 'ingredient_id' => 24, 'quantity' => 3],   // Картофель, 3 шт.
//            ['dish_id' => 4, 'ingredient_id' => 14, 'quantity' => 2],   // Морковь, 2 шт.
//            ['dish_id' => 4, 'ingredient_id' => 25, 'quantity' => 4],   // Яйца, 4 шт.
//            ['dish_id' => 4, 'ingredient_id' => 26, 'quantity' => 300], // Варёная колбаса, 300 г
//            ['dish_id' => 4, 'ingredient_id' => 27, 'quantity' => 200], // Консервированный горошек, 200 г
//            ['dish_id' => 4, 'ingredient_id' => 28, 'quantity' => 3],   // Солёные огурцы, 3 шт.
//            ['dish_id' => 4, 'ingredient_id' => 15, 'quantity' => 1],   // Лук, 1 шт. (по желанию)
//            ['dish_id' => 4, 'ingredient_id' => 21, 'quantity' => 4],   // Майонез, 4 ст.л.
//            ['dish_id' => 4, 'ingredient_id' => 6, 'quantity' => 1],    // Соль, по вкусу
//            ['dish_id' => 4, 'ingredient_id' => 7, 'quantity' => 1],    // Перец, по вкусу
//
//
//            // Для блюда 'Греческий'
//            ['dish_id' => 5, 'ingredient_id' => 29, 'quantity' => 2],   // Помидоры, 2 шт.
//            ['dish_id' => 5, 'ingredient_id' => 30, 'quantity' => 1],   // Огурцы, 1 шт.
//            ['dish_id' => 5, 'ingredient_id' => 31, 'quantity' => 1],   // Красный лук, 1 шт.
//            ['dish_id' => 5, 'ingredient_id' => 32, 'quantity' => 1],   // Сладкий перец, 1 шт.
//            ['dish_id' => 5, 'ingredient_id' => 33, 'quantity' => 100], // Маслины без косточек, 100 г
//            ['dish_id' => 5, 'ingredient_id' => 34, 'quantity' => 150], // Сыр фета, 150 г
//            ['dish_id' => 5, 'ingredient_id' => 18, 'quantity' => 30],  // Оливковое масло, 30 мл
//            ['dish_id' => 5, 'ingredient_id' => 35, 'quantity' => 1],   // Орегано, 1 ч.л.
//            ['dish_id' => 5, 'ingredient_id' => 6, 'quantity' => 1],    // Соль, по вкусу
//            ['dish_id' => 5, 'ingredient_id' => 7, 'quantity' => 1],    // Перец, по вкусу
//
//
//            // Для блюда 'Куриные котлеты'
//            ['dish_id' => 6, 'ingredient_id' => 36, 'quantity' => 500], // Куриный фарш, 500 г
//            ['dish_id' => 6, 'ingredient_id' => 15, 'quantity' => 1],   // Лук, 1 шт.
//            ['dish_id' => 6, 'ingredient_id' => 12, 'quantity' => 2],   // Чеснок, 2 зубчика
//            ['dish_id' => 6, 'ingredient_id' => 17, 'quantity' => 1],   // Белый хлеб, 1 ломтик
//            ['dish_id' => 6, 'ingredient_id' => 37, 'quantity' => 50],  // Молоко, 50 мл
//            ['dish_id' => 6, 'ingredient_id' => 25, 'quantity' => 1],   // Яйца, 1 шт.
//            ['dish_id' => 6, 'ingredient_id' => 6, 'quantity' => 1],    // Соль, по вкусу
//            ['dish_id' => 6, 'ingredient_id' => 7, 'quantity' => 1],    // Перец, по вкусу
//            ['dish_id' => 6, 'ingredient_id' => 16, 'quantity' => 50],  // Растительное масло, 50 мл
//            ['dish_id' => 6, 'ingredient_id' => 38, 'quantity' => 50],  // Панировочные сухари, 50 г
//
//            // Для блюда 'Рассольник'
//            ['dish_id' => 7, 'ingredient_id' => 9, 'quantity' => 500],    // Мясо (говядина), 500 г
//            ['dish_id' => 7, 'ingredient_id' => 24, 'quantity' => 3],     // Картофель, 3 шт.
//            ['dish_id' => 7, 'ingredient_id' => 14, 'quantity' => 1],     // Морковь, 1 шт.
//            ['dish_id' => 7, 'ingredient_id' => 15, 'quantity' => 1],     // Лук, 1 шт.
//            ['dish_id' => 7, 'ingredient_id' => 28, 'quantity' => 3],     // Соленые огурцы, 3 шт.
//            ['dish_id' => 7, 'ingredient_id' => 4, 'quantity' => 2],      // Томатная паста, 2 ст.л.
//            ['dish_id' => 7, 'ingredient_id' => 6, 'quantity' => 1],      // Соль, по вкусу
//
//            // Для блюда 'Жареная рыба с картофелем'
//            ['dish_id' => 8, 'ingredient_id' => 24, 'quantity' => 4],     // Картофель, 4 шт.
//            ['dish_id' => 8, 'ingredient_id' => 16, 'quantity' => 50],    // Растительное масло, 50 мл
//            ['dish_id' => 8, 'ingredient_id' => 6, 'quantity' => 1],      // Соль, по вкусу
//            ['dish_id' => 8, 'ingredient_id' => 7, 'quantity' => 1],      // Перец, по вкусу
//
//            // Для блюда 'Винегрет'
//            ['dish_id' => 9, 'ingredient_id' => 3, 'quantity' => 2],      // Свекла, 2 шт.
//            ['dish_id' => 9, 'ingredient_id' => 24, 'quantity' => 3],     // Картофель, 3 шт.
//            ['dish_id' => 9, 'ingredient_id' => 14, 'quantity' => 1],     // Морковь, 1 шт.
//            ['dish_id' => 9, 'ingredient_id' => 28, 'quantity' => 3],     // Соленые огурцы, 3 шт.
//            ['dish_id' => 9, 'ingredient_id' => 27, 'quantity' => 100],   // Консервированный горошек, 100 г
//            ['dish_id' => 9, 'ingredient_id' => 18, 'quantity' => 30],    // Растительное масло, 30 мл
//
//            // Для блюда 'Солянка'
//            ['dish_id' => 10, 'ingredient_id' => 9, 'quantity' => 500],   // Мясо (говядина), 500 г
//            ['dish_id' => 10, 'ingredient_id' => 26, 'quantity' => 200],  // Колбаса, 200 г
//            ['dish_id' => 10, 'ingredient_id' => 28, 'quantity' => 3],    // Соленые огурцы, 3 шт.
//            ['dish_id' => 10, 'ingredient_id' => 4, 'quantity' => 2],     // Томатная паста, 2 ст.л.
//            ['dish_id' => 10, 'ingredient_id' => 33, 'quantity' => 50],   // Маслины, 50 г
//
//            // Для блюда 'Тефтели в томатном соусе'
//            ['dish_id' => 11, 'ingredient_id' => 36, 'quantity' => 400],  // Куриный фарш, 400 г
//            ['dish_id' => 11, 'ingredient_id' => 15, 'quantity' => 1],    // Лук, 1 шт.
//            ['dish_id' => 11, 'ingredient_id' => 12, 'quantity' => 2],    // Чеснок, 2 зубчика
//            ['dish_id' => 11, 'ingredient_id' => 38, 'quantity' => 50],   // Панировочные сухари, 50 г
//            ['dish_id' => 11, 'ingredient_id' => 4, 'quantity' => 3],     // Томатная паста, 3 ст.л.
//            ['dish_id' => 11, 'ingredient_id' => 6, 'quantity' => 1],     // Соль, по вкусу
//
//            // Для блюда 'Сельдь под шубой'
//            ['dish_id' => 12, 'ingredient_id' => 3, 'quantity' => 1],     // Свекла, 1 шт.
//            ['dish_id' => 12, 'ingredient_id' => 24, 'quantity' => 2],    // Картофель, 2 шт.
//            ['dish_id' => 12, 'ingredient_id' => 14, 'quantity' => 1],    // Морковь, 1 шт.
//            ['dish_id' => 12, 'ingredient_id' => 39, 'quantity' => 100],  // Сельдь, 100 г
//            ['dish_id' => 12, 'ingredient_id' => 25, 'quantity' => 50],   // Майонез, 50 г
//
//            // Для блюда 'Макароны по-флотски'
//            ['dish_id' => 13, 'ingredient_id' => 31, 'quantity' => 200],  // Макароны, 200 г
//            ['dish_id' => 13, 'ingredient_id' => 36, 'quantity' => 300],  // Куриный фарш, 300 г
//            ['dish_id' => 13, 'ingredient_id' => 16, 'quantity' => 50],   // Растительное масло, 50 мл
//            ['dish_id' => 13, 'ingredient_id' => 6, 'quantity' => 1],     // Соль, по вкусу
//            // Для блюда 'Макароны по-флотски'
//            ['dish_id' => 13, 'ingredient_id' => 31, 'quantity' => 200],  // Макароны, 200 г
//            ['dish_id' => 13, 'ingredient_id' => 36, 'quantity' => 300],  // Куриный фарш, 300 г
//            ['dish_id' => 13, 'ingredient_id' => 16, 'quantity' => 50],   // Растительное масло, 50 мл
//            ['dish_id' => 13, 'ingredient_id' => 6, 'quantity' => 1],     // Соль, по вкусу
//            // Для блюда "Лазанья"
//            ['dish_id' => 14, 'ingredient_id' => 40, 'quantity' => 250], // Листы лазаньи, 250 г
//            ['dish_id' => 14, 'ingredient_id' => 41, 'quantity' => 500],  // Фарш, 500 г
//            ['dish_id' => 14, 'ingredient_id' => 4, 'quantity' => 2],    // Томатная паста, 2 ст.л.
//            ['dish_id' => 14, 'ingredient_id' => 37, 'quantity' => 500], // Молоко, 500 мл
//            ['dish_id' => 14, 'ingredient_id' => 42, 'quantity' => 3],   // Мука, 3 ст.л.
//            ['dish_id' => 14, 'ingredient_id' => 43, 'quantity' => 200], // Тёртый сыр, 200 г
//
//            // Для блюда "Салат Нисуаз"
//            ['dish_id' => 15, 'ingredient_id' => 44, 'quantity' => 150], // Тунец консервированный, 150 г
//            ['dish_id' => 15, 'ingredient_id' => 20, 'quantity' => 100], // Зелёный салат, 100 г
//            ['dish_id' => 15, 'ingredient_id' => 31, 'quantity' => 1],   // Красный лук, 1 шт.
//            ['dish_id' => 15, 'ingredient_id' => 30, 'quantity' => 2],   // Огурцы, 2 шт.
//            ['dish_id' => 15, 'ingredient_id' => 29, 'quantity' => 2],   // Помидоры, 2 шт.
//
//        ]);
    }
}
